{"Section 4-7: Design Arguments": ["What should users do? (And what should happen when they do it?)", "Where can designs go wrong? What may prevent a user from reaching their goal?", "What are the core characteristics of your design?", "Why would the design work?"], "Section 10: Interface Arguments": ["Problem Statement", "Why Important?", "Desired Outcome", "Core Obstacles", "Interface Feature", "Interface Argument"], "Section 8-9: Check you Design Argument": ["What is your conceptual approach to solving the problem?", "What is your design argument?", "Will your design work? Is it novel?"], "Section 14a: Study Aims and Expected Outcomes": ["What is the goal of conducting your study?"], "Section 16: Data Collection": ["How will you collect data?", "What specific data will you collect?", "What measures and claims does the collected data inform?"], "Section 13: System Models": ["How does the system actually work?", "Does the system solve the technical challenges?"], "Section 3: Describe Broader Impact": ["Who is the practical audience?", "Why do they care (is this problem important?)", "What’s your problem statement? (Does it capture a core tension? Agent wants X but Y)"], "Section 12: System Arguments": ["Problem Statement", "Why Important?", "Desired Outcome", "Core Obstacles", "Method or Technique", "Technical Argument"], "Section 11: Interface Models": ["From the user perspective, how does the system work? (Journey Map, Storyboard, Lofi Prototype)", "Does the interface solve the user’s problem?"], "Section 15b: Study Setup (Scenario)": ["What are the testing conditions?", "When and where will they use the app?", "How often will they use the app, and how long at a time?", "What are the dates of testing, and the total duration?", "What high-level tasks will the users be asked to perform?"], "Section 15a: Study Setup (Participants)": ["Demographics", "Recruitment Method", "Additional User Requirements", "How will they communicate with you during study?", "How will they be compensated?"], "Section 1: Identify a Design Situation": ["Who are the users?", "What are their high level tasks and goals?"], "Section 18: Design Implications": ["Based on your findings, what are your revised design arguments?", "Based on your findings, how will your interface model change?", "Based on your findings, how will your system model change?", "Based on your findings, how will your study design change?"], "Section 2: Test if a Design Problem": ["Are users struggling to accomplish their goals (what are their struggles?)", "Are these struggles the result of a design challenge?", "Can the problem already be solved with current technology?"], "Section 17: Core Findings": ["What is your core finding?", "Statement of research question", "Re-state core finding", "Provide evidence for core finding", "What parts of your design argument were correct?", "What parts of your design argument were incorrect?", "What parts of your design argument or claims couldn't be tested?", "What new obstacles were encountered for reaching the desired outcomes?"], "Section 14b: Study Aims and Expected Outcomes": ["What research question will your study answer?", "What are your design arguments and claims going into the study?", "What are your measures for your design argument/claims?"]}